code-review/NRB_3471_3546/База_Было/InformationRegisters/ОтветственныеЛицаОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОтветственныеЛицаОрганизаций</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ДолжностиОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОтветственноеЛицо</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ОтветственныеЛицаОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Enums/ТипыКонтактнойИнформации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыКонтактнойИнформации</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Адрес</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефон</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдресЭлектроннойПочты</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВебСтраница</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Другое</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/CommonModules/РегуляторнаяОтчетность/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Возвращает фабрику типов XDTO на основании описания XSD схемы
// Параметры:
//	СхемаXSD - ДвоичныеДанные - содержит описание XSD схемы (как в XSD файле).
// Возвращаемое значение:
//	- ФабрикаXDTO - фабрика типов XDTO
Функция ФабрикаИзСхемыXSD(СхемаXSD) Экспорт
	ИмяВременногоФайлаСхемы = ПолучитьИмяВременногоФайла("xsd");
	СхемаXSD.Записать(ИмяВременногоФайлаСхемы);
	Чтение = Новый ЧтениеXML;
	Чтение.ОткрытьФайл(ИмяВременногоФайлаСхемы);
	Построитель = Новый ПостроительDOM;
	Дом = Построитель.Прочитать(Чтение);
	Построитель = Новый ПостроительСхемXML;
	Схема = Построитель.СоздатьСхемуXML(Дом);
	НаборСхем = Новый НаборСхемXML;
	НаборСхем.Добавить(Схема);
	Фабрика = Новый ФабрикаXDTO(НаборСхем);
	Чтение.Закрыть();
	УдалитьФайлы(ИмяВременногоФайлаСхемы);
	
	Возврат Фабрика;
КонецФункции

// Функция формирует подраздел отчета в виде табличного документа по макету Макет, содержащему
// области ОбластьШапка и ОбластьСтрокаОтчета на основании данных ДанныеПодраздела и возвращает
// этот табличный документ.
// Параметры:
//	Макет - ТабличныйДокумент
//	Данные - ТабличнаяЧасть - или ТаблицаЗначений
// Возвращаемое значение:
//	- ТабличныйДокумент
Функция ЗаполненныйДаннымиМакетПодраздела(Макет, Данные) Экспорт
	ТабДок = Новый ТабличныйДокумент;
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьСтрокаОтчета = Макет.ПолучитьОбласть("ОбластьСтрокаОтчета");
	
	ТабДок.Вывести(ОбластьШапка);
	Для Каждого СтрокаДанных Из Данные Цикл
		ОбластьСтрокаОтчета.Параметры.Заполнить(СтрокаДанных);
		ТабДок.Вывести(ОбластьСтрокаОтчета);
	КонецЦикла;
	
	ТабДок.ФиксацияСверху = 5;
	ТабДок.ФиксацияСлева = 1;
	
	Возврат ТабДок;
КонецФункции

// Заполняет информацию об ответственном лице организации в значении XDTO (объекте/структуре)
// Параметры:
//	ОтветственноеЛицо - ЗначениеXDTO
//	Организация - СправочникСсылка.Организации
//	ТипОтветственногоЛица - ПеречислениеСсылка.ОтветственныеЛицаОрганизаций
//	ОтчетнаяДата - Дата
Процедура ЗаполнитьИнформациюОбОтветственномЛице(ОтветственноеЛицо, Организация, ТипОтветственногоЛица, ОтчетнаяДата) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОтветственныеЛицаОрганизацийСрезПоследних.ФизическоеЛицо КАК ФизическоеЛицо,
	|	ОтветственныеЛицаОрганизацийСрезПоследних.Должность КАК Должность
	|ИЗ
	|	РегистрСведений.ОтветственныеЛицаОрганизаций.СрезПоследних(
	|			&ОтчетнаяДата,
	|			СтруктурнаяЕдиница = &Организация
	|				И ОтветственноеЛицо = &ТипОтветственногоЛица) КАК ОтветственныеЛицаОрганизацийСрезПоследних";
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("ТипОтветственногоЛица", ТипОтветственногоЛица);
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ОтветственноеЛицо.Должность = Строка(Выборка.Должность);
		ФизическоеЛицо = Выборка.ФизическоеЛицо;
		ОтветственноеЛицо.ФИО = Строка(Выборка.ФизическоеЛицо);
		Если (ТипОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.Исполнитель
				Или ТипОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности)
				И ЗначениеЗаполнено(ФизическоеЛицо) Тогда
			Телефон = КонтактнаяИнформацияНаОтчетнуюДату(ФизическоеЛицо,
							Перечисления.ТипыКонтактнойИнформации.Телефон, Справочники.ВидыКонтактнойИнформации.ТелефонСлужебныйФизЛица, ОтчетнаяДата);
			ЭлПочта = КонтактнаяИнформацияНаОтчетнуюДату(ФизическоеЛицо, 
											Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты, Справочники.ВидыКонтактнойИнформации.EmailФизЛица, ОтчетнаяДата);
			Если ТипОтветственногоЛица = Перечисления.ОтветственныеЛицаОрганизаций.ИсполнительВРегуляторнойОтчетности Тогда
				Если Не ЗначениеЗаполнено(Телефон) Тогда
					Текст = "У составителя-исполнителя регуляторной отчетности (" + ОтветственноеЛицо.ФИО + ") не указан служебный телефон,"
							+ Символы.ПС + " такая отчетность будет некорректной!";
					ОбщегоНазначенияклиентСервер.СообщитьПользователю(Текст);
				Иначе
					ОтветственноеЛицо.Телефон = Телефон;
				КонецЕсли;
				Если Не ЗначениеЗаполнено(ЭлПочта) Тогда
					Текст = "У составителя-исполнителя регуляторной отчетности (" + ОтветственноеЛицо.ФИО + ") не указан адрес электронной почты,"
							+ Символы.ПС + " такая отчетность будет некорректной!";
					ОбщегоНазначенияклиентСервер.СообщитьПользователю(Текст);
				Иначе
					ОтветственноеЛицо.ЭлПочта = ЭлПочта;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Заполняет информацию об организации в значении XDTO (объекте/структуре)
// Параметры:
//	Составитель - ЗначениеXDTO
//	Организация - СправочникСсылка.Организации
//	ОтчетнаяДата - Дата
Процедура ЗаполнитьИнформациюОбОрганизации(Составитель, Организация, ОтчетнаяДата) Экспорт
	ОписаниеОшибок = "";
	Принадлежность = "организации";
	
	НомерЛицензииБанка = НомерЛицензии(Организация, Справочники.ВидыЛицензий.БанковскаяДеятельность);
	Если ПустаяСтрока(НомерЛицензииБанка) Тогда
		ОписаниеОшибок = "Не указан номер банковской лицензии в списке лицензий" + Принадлежность + Строка(Организация);
	КонецЕсли;
	
	ПроверитьЦифровуюСтроку(ОписаниеОшибок, "БИК", Принадлежность, Организация.БИК, Организация, 9);
	ДопустимыеДлиныОКАТО = Новый Массив;
	ДопустимыеДлиныОКАТО.Добавить(8);
	ДопустимыеДлиныОКАТО.Добавить(2);
	ДопустимыеДлиныОКАТО.Добавить(5);
	ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОКАТО", Принадлежность, Организация.КодПоОКАТО, Организация, ДопустимыеДлиныОКАТО);
	ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОКПО", Принадлежность, Организация.КодПоОКПО, Организация, 8);
	ПроверитьЦифровуюСтроку(ОписаниеОшибок, "ОГРН", Принадлежность, Организация.ОГРН, Организация, 13);
	
	Если ПустаяСтрока(ОписаниеОшибок) Тогда
		Составитель.ВидОрг = "КО";
		Составитель.КодОрг = НомерЛицензииБанка;
		ПрисвоитьНепустое(Составитель.БИК, Организация.БИК);
		ПрисвоитьНепустое(Составитель.ОКАТО, Организация.КодПоОКАТО);
		ПрисвоитьНепустое(Составитель.ОКПО, Организация.КодПоОКПО);
		ПрисвоитьНепустое(Составитель.ОГРН, Организация.ОГРН);
		// BSLLS:Typo-off
		Составитель.СокрНаимен = Организация.Наименование;
		// BSLLS:Typo-on
		Составитель.Адрес = КонтактнаяИнформацияНаОтчетнуюДату(Организация, Перечисления.ТипыКонтактнойИнформации.Адрес, 
								Справочники.ВидыКонтактнойИнформации.ФактАдресОрганизации, ОтчетнаяДата);
		Составитель.ДатаПодписания = НачалоДня(ТекущаяДатаСеанса());
	Иначе
		ВызватьИсключение "Не возможно создать XML по причине: " + ОписаниеОшибок;
	КонецЕсли;
КонецПроцедуры

// Проверяет что строка пуста или состоит только из цифр, если есть ошибки их описание добавляется
// в возвращемый параметр Ошибки
// Параметры:
//	Ошибки - Строка - в эту строку добавляется описание ошибок
//	СущностьРеквизита - Строка - наименование сущности, значение которой представляет строка, например "ИНН"
//	Принадлежность - Строка - наименования сущности, реквизитом которой является строка, например "эмитента"
//	Строка - Строка - проверяемая строка
//	Владелец - СправочникСсылка - ссылка на сущность, реквизитом которой является строка, например на элемент
//				справочника контрагентов
//	ДопустимаяДлина - Число - допустимая длина проверяемой строки, может таже быть также массивом с несколькими
//						целыми числами представлющими допустимые длины.
//	ОбязательноНепустоеЗначение - Булево - обязательность непустого значения
Процедура ПроверитьЦифровуюСтроку(Ошибки, СущностьРеквизита, Принадлежность, Строка, Владелец,
											ДопустимаяДлина, ОбязательноНепустоеЗначение = Ложь) Экспорт
	
	Если ЗначениеЗаполнено(Строка) Тогда
		// Проверим длину строки
		ПроверитьДлинуСтроки(Ошибки, СущностьРеквизита, Принадлежность, Строка, Владелец, ДопустимаяДлина);
		
		// Проверим символы строки - должны быть только цифры
		Если Не ОбщегоНазначения.ТолькоЦифрыВСтроке(Строка) Тогда
			Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС)
							+ "Не цифровые символы в " + СущностьРеквизита + " " + Принадлежность + " "
							+ Строка(Владелец) + " (" + СущностьРеквизита + ": " + Строка + ")";
		КонецЕсли;
	Иначе
		Если ОбязательноНепустоеЗначение Тогда
			Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС)
							+ "Не задано значение " + СущностьРеквизита + " " + Принадлежность + " "
							+ Строка(Владелец) + " (" + СущностьРеквизита + ": " + Строка + ")";
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

// Присваивает Приемнику значение Источника, если оно не пустое.
// Параметры:
// 	Приемник - Строка - или любой другой тип
//	Источник - Строка - или любой другой тип
Процедура ПрисвоитьНепустое(Приемник, Источник) Экспорт
	Если ЗначениеЗаполнено(Источник) Тогда
		Приемник = Источник;
	КонецЕсли;
КонецПроцедуры

// Возвращает номер лицензии указнного вида, для указнной Организации
// Параметры:
//	Организация - СправочникСсылка.Организации
//	ВидЛицензии - СправочникСсылка.ВидыЛицензий
// Возвращаемое значение:
//	- Строка
Функция НомерЛицензии(Организация, ВидЛицензии) Экспорт
	НомерЛицензии = "";
	
	СтрокаТЧ = Организация.Лицензии.Найти(ВидЛицензии, "ТипЛицензии");
	Если СтрокаТЧ <> Неопределено Тогда
		НомерЛицензии = СтрокаТЧ.НомерЛицензии;
	КонецЕсли;
	
	Возврат НомерЛицензии;
КонецФункции

// Возвращает массив допустимых длин ИНН
// Возвращаемое значение:
//	- Массив - массив целых чисел
Функция ДопустимыеДлиныИНН() Экспорт
	ДопустимыеДлиныИНН = Новый Массив;
	ДопустимыеДлиныИНН.Добавить(10);
	ДопустимыеДлиныИНН.Добавить(12);
	
	Возврат ДопустимыеДлиныИНН;
КонецФункции

// Возвращает массив допустимых длин ОГРН
// Возвращаемое значение:
//	- Массив - массив целых чисел
Функция ДопустимыеДлиныОГРН() Экспорт
	ДопустимыеДлиныОГРН = Новый Массив;
	ДопустимыеДлиныОГРН.Добавить(13);
	ДопустимыеДлиныОГРН.Добавить(15);
	
	Возврат ДопустимыеДлиныОГРН;
КонецФункции

// Выгружает отчетность в файл
// Параметры:
//	Фабрика - ФабрикаXDTO
//	Отчетность - ЗначениеXDTO
//	ИмяФормы - Строка
//	ПериодНачало - Дата
//	ПериодКонец - Дата
Процедура ЗаписатьОтчетностьДляДельтыВXML(Фабрика, Отчетность, ИмяФормы, ПериодНачало, ПериодКонец) Экспорт
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.УстановитьСтроку("windows-1251");
	ЗаписьXML.ЗаписатьОбъявлениеXML();
	Фабрика.ЗаписатьXML(ЗаписьXML, Отчетность);
	СтрокаXML = ЗаписьXML.Закрыть();
	ТекстXML = Новый ТекстовыйДокумент;
	ТекстXML.ДобавитьСтроку(СтрокаXML);
	
	Попытка
		ПапкаДанных = ВнешниеДанные.ПолучитьПараметрыВнешнегоИсточника(
						ПланыВидовХарактеристик.ВнешниеИсточники.КаталогВыгрузкиОтчетовВДельту).Папка;
		ПапкаДанных = СокрЛП(ПапкаДанных);
		ФорматнаяСтрокаДатаБезВремени = "ДФ=yyyyMMdd";
		Если ПериодНачало = Неопределено Тогда
			ОписаниеПериода = Формат(ПериодКонец, ФорматнаяСтрокаДатаБезВремени);
		Иначе
			ОписаниеПериода = Формат(ПериодНачало, ФорматнаяСтрокаДатаБезВремени) + "_" + Формат(ПериодКонец, ФорматнаяСтрокаДатаБезВремени);
		КонецЕсли;
		ОписаниеДатыФормирования = Формат(ТекущаяДатаСеанса(), "ДФ=yyyyMMddHHmmss");
		ИмяОтчета = ИмяФормы + "_DEPO_" + ОписаниеПериода + "_" + ОписаниеДатыФормирования;
		ТекстXML.Записать(ПапкаДанных + "\" + ИмяОтчета + ".xml", "windows-1251");
	Исключение
		Сообщение = "Не удалось записать файл по причине:" + ОписаниеОшибки() + "
		|Возможно указанный в настройках каталог 'Каталог выгрузки отчетов в Дельту' недоступен или путь некорректен!";
		ОбщегоНазначения.СообщитьОбОшибке(Сообщение);
	КонецПопытки;
КонецПроцедуры

// Добавляет описание очередной ошибки к списку всех выявленных ошибок
// Параметры:
//	ОписаниеОшибок - Строка - возвращаемый праметр
//	ОписаниеОшибки - Строка
Процедура ДобавитьОписаниеОшибки(ОписаниеОшибок, ОписаниеОшибки) Экспорт
	ОписаниеОшибок =  ОписаниеОшибок + ?(ПустаяСтрока(ОписаниеОшибок), "", Символы.ПС) + ОписаниеОшибки;
КонецПроцедуры

// Получает результат элемент массива по его номеру, отсчитываемому с конца, начиная с 1
// Параметры:
//	РезультатПакета - Массив - Массив результатов запросов
//	НомерСКонца - Число - номер результата запроса в массиве, отсчитанный с конца, (отсчет начиная с единицы)
// Возвращаемое значение:
//	- ТаблицаЗначений - результат запроса найденного по его номеру в пакете, отсчитанному с конца;
Функция РезультатВВидеТЗПоНомеруВПакетеСКонца(РезультатПакета, НомерСКонца) Экспорт
	Индекс = РезультатПакета.Количество() - НомерСКонца;
	ТЗРезультатЗапроса = РезультатПакета[Индекс].Выгрузить();
	
	Возврат ТЗРезультатЗапроса;
КонецФункции

// Возвращает описание ошибки, связанной с ЦБ
// Параметры:
//	ЦБ - СправочникСсылка.ЦенныеБумаги
//	ВидОшибки - Строка
//	ISIN - Строка
//	РегНомер - Строка
// Возвращаемое значение:
// 	- Строка
Функция ОписаниеОшибкиЦБ(ЦБ, ВидОшибки, ISIN = Неопределено, РегНомер = Неопределено) Экспорт
	Описание = "Для ЦБ " + Строка(ЦБ);
	Если ЗначениеЗаполнено(ISIN) Или ЗначениеЗаполнено(РегНомер) Тогда
		Описание = Описание + " (";
		Если ЗначениеЗаполнено(ISIN) Тогда
			Описание = Описание + "ISIN: " + ISIN;
		КонецЕсли;
		Если ЗначениеЗаполнено(ISIN) И ЗначениеЗаполнено(РегНомер) Тогда
			Описание = Описание + "; ";
		КонецЕсли;
		Если ЗначениеЗаполнено(РегНомер) Тогда
			Описание = Описание + "Номер регистрации: " + РегНомер;
		КонецЕсли;
		Описание = Описание + ")";
	КонецЕсли;
	Описание = Описание + " " + ВидОшибки;
	
	Возврат Описание;
КонецФункции

// Проверяет что все обязательные к заполнению (согласно схеме XML) поля заполнены
// Параметры:
//	ТЧ - ТабличнаяЧасть
//	МетаданныеТЧ - ОбъектМетаданных - ОбъектМетаданных: ТабличнаяЧасть
//	СписокПроверяемыхКолонок - Строка - имена проверяемых колонок через запятую
//	ИмяКолонкиСНомеромСтроки - Строка
//	ОписаниеОшибок - Строка
// Возвращаемое значение:
//	- Булево
Функция ЗаполненыОбязательныеКолонкиДляВыгрузкиВXML(ТЧ, МетаданныеТЧ, СписокПроверяемыхКолонок,
															ИмяКолонкиСНомеромСтроки, ОписаниеОшибок) Экспорт
	ЗаполненыВсеОбязательныеКолонки = Истина;
	ПроверяемыеКолонки = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(СтрЗаменить(СписокПроверяемыхКолонок, " ", ""));
	Для каждого СтрокаТЧ Из ТЧ Цикл
		Для Каждого ИмяКолонки Из ПроверяемыеКолонки Цикл
			Если Не ЗначениеЗаполнено(СтрокаТЧ[ИмяКолонки]) Тогда
				Если ЗаполненыВсеОбязательныеКолонки Тогда
					ДобавитьОписаниеОшибки(ОписаниеОшибок, "");
					ДобавитьОписаниеОшибки(ОписаниеОшибок, "---------- " + МетаданныеТЧ.Синоним + ": Контроль перед выгрузкой в XML ----------- ");
					ЗаполненыВсеОбязательныеКолонки = Ложь;
				КонецЕсли;
				МетаданныеКолонки = МетаданныеТЧ.Реквизиты.Найти(ИмяКолонки);
				Текст =  "В строке " + СтрокаТЧ[ИмяКолонкиСНомеромСтроки]
							+ " не заполнена колонка """ + МетаданныеКолонки.Синоним + """";
				ДобавитьОписаниеОшибки(ОписаниеОшибок, Текст);
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ЗаполненыВсеОбязательныеКолонки;
КонецФункции

// Нумерует строки в данных начиная с 1
// Параметры:
//	Данные - ТабличнаяЧасть - Табличная часть или таблица значений, должна содержать числовую колонку НомСтр
Процедура ПронумероватьСтроки(Данные) Экспорт
	НомСтр = 0;
	Для каждого Строка Из Данные Цикл
		НомСтр = НомСтр + 1;
		Строка.НомСтр = НомСтр;
	КонецЦикла;
КонецПроцедуры


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Процедура ПроверитьДлинуСтроки(Ошибки, СущностьРеквизита, Принадлежность, Строка, Владелец, ДопустимаяДлина)
	ДлинаСтроки = СтрДлина(Строка);
	ДлинаДопустима = Ложь;
	
	Если ТипЗнч(ДопустимаяДлина) = Тип("Число") Тогда
		ДопустимыеДлины = Новый Массив;
		ДопустимыеДлины.Добавить(ДопустимаяДлина);
	Иначе
		ДопустимыеДлины = ДопустимаяДлина;
	КонецЕсли;
	
	Для каждого ОднаИзДопустимыхДлин Из ДопустимыеДлины Цикл
		Если ДлинаСтроки = ОднаИзДопустимыхДлин Тогда
			ДлинаДопустима = Истина;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	Если Не ДлинаДопустима Тогда
		Ошибки = Ошибки + ?(ПустаяСтрока(Ошибки), "", Символы.ПС)
						+ "Недопустимая длина " + СущностьРеквизита + " у " + Принадлежность + " " + Строка(Владелец)
						+ " (" + СущностьРеквизита + ": " + Строка + ")" + " - должно быть " + ОписаниеДопустимойДлиныСтрокой(ДопустимаяДлина);
	КонецЕсли;
КонецПроцедуры

Функция ОписаниеДопустимойДлиныСтрокой(ДопустимаяДлина)
	Если ТипЗнч(ДопустимаяДлина) = Тип("Число") Тогда
		Описание = Строка(ДопустимаяДлина);
		КоличествоЦифрУПоследнейДлины = ДопустимаяДлина;
	Иначе
		Счетчик = 0;
		КоличествоЭлементов = ДопустимаяДлина.Количество();
		Описание = "";
		Для каждого ОднаИзДопустимыхДлин Из ДопустимаяДлина Цикл
			Счетчик = Счетчик + 1;
			Если Счетчик = 1 Тогда
				Описание = Строка(ОднаИзДопустимыхДлин);
			ИначеЕсли Счетчик = КоличествоЭлементов Тогда
				Описание = Описание + " или " + Строка(ОднаИзДопустимыхДлин);
				КоличествоЦифрУПоследнейДлины = ОднаИзДопустимыхДлин;
			Иначе
				Описание = Описание + ", " + Строка(ОднаИзДопустимыхДлин);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
		
	Описание = Описание + " " + ФормаСловаЦифра(КоличествоЦифрУПоследнейДлины);
	
	Возврат Описание;
КонецФункции

Функция ФормаСловаЦифра(КоличествоЦифр)
	// BSLLS:MagicNumber-off
	
	Если КоличествоЦифр > 5 И КоличествоЦифр < 21 Тогда
		ФормаСловаЦифра = "цифр";
	Иначе
		КоличествоЦифр = КоличествоЦифр % 10;
		Если КоличествоЦифр = 1 Тогда
			ФормаСловаЦифра = "цифра";
		ИначеЕсли КоличествоЦифр < 5 Тогда
			ФормаСловаЦифра = "цифры";
		Иначе
			ФормаСловаЦифра = "цифр";
		КонецЕсли;
	КонецЕсли;
	
	Возврат ФормаСловаЦифра;
	
	// BSLLS:MagicNumber-on
КонецФункции

Функция КонтактнаяИнформацияНаОтчетнуюДату(Объект, ТипКонтактнойИнформации, ВидКонтактнойИнформации, ОтчетнаяДата)
	КонтактнаяИнформацияНаОтчетнуюДату = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	КонтактнаяИнформацияСрезПоследних.Представление КАК Представление
	|ИЗ
	|	РегистрСведений.КонтактнаяИнформация.СрезПоследних(
	|			&ОтчетнаяДата,
	|			Объект = &Объект
	|				И Тип = &Тип
	|				И Вид = &Вид) КАК КонтактнаяИнформацияСрезПоследних";
	Запрос.УстановитьПараметр("ОтчетнаяДата", ОтчетнаяДата);
	Запрос.УстановитьПараметр("Объект", Объект);
	Запрос.УстановитьПараметр("Тип", ТипКонтактнойИнформации);
	Запрос.УстановитьПараметр("Вид", ВидКонтактнойИнформации);
	РезультатЗапроса = Запрос.Выполнить();
	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		КонтактнаяИнформацияНаОтчетнуюДату = Выборка.Представление;
	КонецЕсли;
	
	Возврат КонтактнаяИнформацияНаОтчетнуюДату;
КонецФункции

#КонецОбласти
